results/results_m5_large/results_m5_large_run3/oltp_read_only_t16/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 104.38 qps: 1683.56 (r/w/o: 1473.20/0.00/210.36) lat (ms,95%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 104.70 qps: 1673.34 (r/w/o: 1463.94/0.00/209.41) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 100.30 qps: 1606.69 (r/w/o: 1406.10/0.00/200.60) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 109.90 qps: 1758.21 (r/w/o: 1538.41/0.00/219.80) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 110.70 qps: 1774.49 (r/w/o: 1553.19/0.00/221.30) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 107.20 qps: 1710.80 (r/w/o: 1496.40/0.00/214.40) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 109.10 qps: 1747.91 (r/w/o: 1529.61/0.00/218.30) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 109.80 qps: 1753.40 (r/w/o: 1533.80/0.00/219.60) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 111.20 qps: 1782.90 (r/w/o: 1560.50/0.00/222.40) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 111.20 qps: 1774.79 (r/w/o: 1552.39/0.00/222.40) lat (ms,95%): 231.53 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 106.50 qps: 1710.90 (r/w/o: 1497.90/0.00/213.00) lat (ms,95%): 253.35 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 110.60 qps: 1767.50 (r/w/o: 1546.30/0.00/221.20) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            181608
        write:                           0
        other:                           25944
        total:                           207552
    transactions:                        12972  (108.00 per sec.)
    queries:                             207552 (1728.06 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      108.0039
    time elapsed:                        120.1068s
    total number of events:              12972

Latency (ms):
         min:                                   48.76
         avg:                                  148.07
         max:                                  390.38
         95th percentile:                      244.38
         sum:                              1920774.95

Threads fairness:
    events (avg/stddev):           810.7500/6.60
    execution time (avg/stddev):   120.0484/0.04